; domain
(define (domain blocksworld-4ops)
  (:requirements :strips)
  (:predicates
    (clear ?x)
    (on-table ?x)
    (arm-empty)
    (holding ?x)
    (on ?x ?y)
  )

  (:action pickup
    :parameters (?ob)
    :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
    :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
      (not (arm-empty)))
  )

  (:action putdown
    :parameters (?ob)
    :precondition (holding ?ob)
    :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
      (not (holding ?ob)))
  )

  (:action stack
    :parameters (?ob ?underob)
    :precondition (and (clear ?underob) (holding ?ob))
    :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
      (not (clear ?underob)) (not (holding ?ob)))
  )

  (:action unstack
    :parameters (?ob ?underob)
    :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
    :effect (and (holding ?ob) (clear ?underob)
      (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))
  )
)

; problem
(define (problem BW-rand-28)
(:domain blocksworld-4ops)
(:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 )
(:init
(arm-empty)
(on b1 b15)
(on b2 b1)
(on b3 b24)
(on-table b4)
(on-table b5)
(on b6 b9)
(on b7 b12)
(on-table b8)
(on b9 b11)
(on-table b10)
(on-table b11)
(on b12 b8)
(on b13 b21)
(on b14 b6)
(on b15 b20)
(on b16 b2)
(on b17 b18)
(on-table b18)
(on b19 b26)
(on b20 b4)
(on b21 b17)
(on b22 b23)
(on b23 b27)
(on b24 b10)
(on b25 b28)
(on-table b26)
(on b27 b13)
(on b28 b16)
(clear b3)
(clear b5)
(clear b7)
(clear b14)
(clear b19)
(clear b22)
(clear b25)
)
(:goal
(and
(on b1 b22)
(on b3 b11)
(on b4 b10)
(on b5 b17)
(on b6 b16)
(on b7 b18)
(on b9 b28)
(on b10 b14)
(on b11 b2)
(on b12 b6)
(on b13 b12)
(on b14 b27)
(on b15 b1)
(on b19 b24)
(on b20 b4)
(on b21 b23)
(on b22 b26)
(on b23 b25)
(on b24 b8)
(on b25 b13)
(on b27 b21)
(on b28 b19))
)
)

; plan
1. (unstack b25 b28)
   deleted: (on b25 b28) (clear b25) (arm-empty)
   added: (holding b25) (clear b28)
   goals met: 1 of 22
2. (putdown b25)
   deleted: (holding b25)
   added: (clear b25) (arm-empty) (on-table b25)
   goals met: 1 of 22
3. (unstack b28 b16)
   deleted: (on b28 b16) (clear b28) (arm-empty)
   added: (holding b28) (clear b16)
   goals met: 1 of 22
4. (putdown b28)
   deleted: (holding b28)
   added: (clear b28) (arm-empty) (on-table b28)
   goals met: 1 of 22
5. (unstack b16 b2)
   deleted: (on b16 b2) (clear b16) (arm-empty)
   added: (holding b16) (clear b2)
   goals met: 1 of 22
6. (putdown b16)
   deleted: (holding b16)
   added: (clear b16) (arm-empty) (on-table b16)
   goals met: 1 of 22
7. (unstack b2 b1)
   deleted: (on b2 b1) (clear b2) (arm-empty)
   added: (holding b2) (clear b1)
   goals met: 1 of 22
8. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 1 of 22
9. (unstack b1 b15)
   deleted: (on b1 b15) (clear b1) (arm-empty)
   added: (holding b1) (clear b15)
   goals met: 1 of 22
10. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 1 of 22
11. (unstack b15 b20)
   deleted: (on b15 b20) (clear b15) (arm-empty)
   added: (holding b15) (clear b20)
   goals met: 1 of 22
12. (putdown b15)
   deleted: (holding b15)
   added: (clear b15) (arm-empty) (on-table b15)
   goals met: 1 of 22
13. (unstack b20 b4)
   deleted: (on b20 b4) (clear b20) (arm-empty)
   added: (holding b20) (clear b4)
   goals met: 0 of 22
14. (putdown b20)
   deleted: (holding b20)
   added: (clear b20) (arm-empty) (on-table b20)
   goals met: 0 of 22
15. (unstack b7 b12)
   deleted: (on b7 b12) (clear b7) (arm-empty)
   added: (holding b7) (clear b12)
   goals met: 0 of 22
16. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 0 of 22
17. (unstack b12 b8)
   deleted: (on b12 b8) (clear b12) (arm-empty)
   added: (holding b12) (clear b8)
   goals met: 0 of 22
18. (putdown b12)
   deleted: (holding b12)
   added: (clear b12) (arm-empty) (on-table b12)
   goals met: 0 of 22
19. (unstack b3 b24)
   deleted: (on b3 b24) (clear b3) (arm-empty)
   added: (holding b3) (clear b24)
   goals met: 0 of 22
20. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 0 of 22
21. (unstack b24 b10)
   deleted: (on b24 b10) (clear b24) (arm-empty)
   added: (holding b24) (clear b10)
   goals met: 0 of 22
22. (putdown b24)
   deleted: (holding b24)
   added: (clear b24) (arm-empty) (on-table b24)
   goals met: 0 of 22
23. (unstack b14 b6)
   deleted: (on b14 b6) (clear b14) (arm-empty)
   added: (holding b14) (clear b6)
   goals met: 0 of 22
24. (putdown b14)
   deleted: (holding b14)
   added: (clear b14) (arm-empty) (on-table b14)
   goals met: 0 of 22
25. (unstack b6 b9)
   deleted: (on b6 b9) (clear b6) (arm-empty)
   added: (holding b6) (clear b9)
   goals met: 0 of 22
26. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 0 of 22
27. (unstack b9 b11)
   deleted: (on b9 b11) (clear b9) (arm-empty)
   added: (holding b9) (clear b11)
   goals met: 0 of 22
28. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 0 of 22
29. (unstack b22 b23)
   deleted: (on b22 b23) (clear b22) (arm-empty)
   added: (holding b22) (clear b23)
   goals met: 0 of 22
30. (putdown b22)
   deleted: (holding b22)
   added: (clear b22) (arm-empty) (on-table b22)
   goals met: 0 of 22
31. (unstack b23 b27)
   deleted: (on b23 b27) (clear b23) (arm-empty)
   added: (holding b23) (clear b27)
   goals met: 0 of 22
32. (putdown b23)
   deleted: (holding b23)
   added: (clear b23) (arm-empty) (on-table b23)
   goals met: 0 of 22
33. (unstack b27 b13)
   deleted: (on b27 b13) (clear b27) (arm-empty)
   added: (holding b27) (clear b13)
   goals met: 0 of 22
34. (putdown b27)
   deleted: (holding b27)
   added: (clear b27) (arm-empty) (on-table b27)
   goals met: 0 of 22
35. (unstack b13 b21)
   deleted: (on b13 b21) (clear b13) (arm-empty)
   added: (holding b13) (clear b21)
   goals met: 0 of 22
36. (putdown b13)
   deleted: (holding b13)
   added: (clear b13) (arm-empty) (on-table b13)
   goals met: 0 of 22
37. (unstack b21 b17)
   deleted: (on b21 b17) (clear b21) (arm-empty)
   added: (holding b21) (clear b17)
   goals met: 0 of 22
38. (putdown b21)
   deleted: (holding b21)
   added: (clear b21) (arm-empty) (on-table b21)
   goals met: 0 of 22
39. (unstack b17 b18)
   deleted: (on b17 b18) (clear b17) (arm-empty)
   added: (holding b17) (clear b18)
   goals met: 0 of 22
40. (putdown b17)
   deleted: (holding b17)
   added: (clear b17) (arm-empty) (on-table b17)
   goals met: 0 of 22
41. (unstack b19 b26)
   deleted: (on b19 b26) (clear b19) (arm-empty)
   added: (holding b19) (clear b26)
   goals met: 0 of 22
42. (putdown b19)
   deleted: (holding b19)
   added: (clear b19) (arm-empty) (on-table b19)
   goals met: 0 of 22
43. (pickup b24)
   deleted: (clear b24) (on-table b24) (arm-empty)
   added: (holding b24)
   goals met: 0 of 22
44. (stack b24 b8)
   deleted: (clear b8) (holding b24)
   added: (arm-empty) (clear b24) (on b24 b8)
   goals met: 1 of 22
45. (pickup b19)
   deleted: (clear b19) (on-table b19) (arm-empty)
   added: (holding b19)
   goals met: 1 of 22
46. (stack b19 b24)
   deleted: (clear b24) (holding b19)
   added: (arm-empty) (clear b19) (on b19 b24)
   goals met: 2 of 22
47. (pickup b28)
   deleted: (clear b28) (on-table b28) (arm-empty)
   added: (holding b28)
   goals met: 2 of 22
48. (stack b28 b19)
   deleted: (clear b19) (holding b28)
   added: (arm-empty) (clear b28) (on b28 b19)
   goals met: 3 of 22
49. (pickup b9)
   deleted: (clear b9) (on-table b9) (arm-empty)
   added: (holding b9)
   goals met: 3 of 22
50. (stack b9 b28)
   deleted: (clear b28) (holding b9)
   added: (arm-empty) (clear b9) (on b9 b28)
   goals met: 4 of 22
51. (pickup b7)
   deleted: (clear b7) (on-table b7) (arm-empty)
   added: (holding b7)
   goals met: 4 of 22
52. (stack b7 b18)
   deleted: (clear b18) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b18)
   goals met: 5 of 22
53. (pickup b6)
   deleted: (clear b6) (on-table b6) (arm-empty)
   added: (holding b6)
   goals met: 5 of 22
54. (stack b6 b16)
   deleted: (clear b16) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b16)
   goals met: 6 of 22
55. (pickup b12)
   deleted: (clear b12) (on-table b12) (arm-empty)
   added: (holding b12)
   goals met: 6 of 22
56. (stack b12 b6)
   deleted: (clear b6) (holding b12)
   added: (arm-empty) (clear b12) (on b12 b6)
   goals met: 7 of 22
57. (pickup b13)
   deleted: (clear b13) (on-table b13) (arm-empty)
   added: (holding b13)
   goals met: 7 of 22
58. (stack b13 b12)
   deleted: (clear b12) (holding b13)
   added: (arm-empty) (clear b13) (on b13 b12)
   goals met: 8 of 22
59. (pickup b25)
   deleted: (clear b25) (on-table b25) (arm-empty)
   added: (holding b25)
   goals met: 8 of 22
60. (stack b25 b13)
   deleted: (clear b13) (holding b25)
   added: (arm-empty) (clear b25) (on b25 b13)
   goals met: 9 of 22
61. (pickup b23)
   deleted: (clear b23) (on-table b23) (arm-empty)
   added: (holding b23)
   goals met: 9 of 22
62. (stack b23 b25)
   deleted: (clear b25) (holding b23)
   added: (arm-empty) (clear b23) (on b23 b25)
   goals met: 10 of 22
63. (pickup b21)
   deleted: (clear b21) (on-table b21) (arm-empty)
   added: (holding b21)
   goals met: 10 of 22
64. (stack b21 b23)
   deleted: (clear b23) (holding b21)
   added: (arm-empty) (clear b21) (on b21 b23)
   goals met: 11 of 22
65. (pickup b27)
   deleted: (clear b27) (on-table b27) (arm-empty)
   added: (holding b27)
   goals met: 11 of 22
66. (stack b27 b21)
   deleted: (clear b21) (holding b27)
   added: (arm-empty) (clear b27) (on b27 b21)
   goals met: 12 of 22
67. (pickup b14)
   deleted: (clear b14) (on-table b14) (arm-empty)
   added: (holding b14)
   goals met: 12 of 22
68. (stack b14 b27)
   deleted: (clear b27) (holding b14)
   added: (arm-empty) (clear b14) (on b14 b27)
   goals met: 13 of 22
69. (pickup b10)
   deleted: (clear b10) (on-table b10) (arm-empty)
   added: (holding b10)
   goals met: 13 of 22
70. (stack b10 b14)
   deleted: (clear b14) (holding b10)
   added: (arm-empty) (clear b10) (on b10 b14)
   goals met: 14 of 22
71. (pickup b4)
   deleted: (clear b4) (on-table b4) (arm-empty)
   added: (holding b4)
   goals met: 14 of 22
72. (stack b4 b10)
   deleted: (clear b10) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b10)
   goals met: 15 of 22
73. (pickup b20)
   deleted: (clear b20) (on-table b20) (arm-empty)
   added: (holding b20)
   goals met: 15 of 22
74. (stack b20 b4)
   deleted: (clear b4) (holding b20)
   added: (arm-empty) (clear b20) (on b20 b4)
   goals met: 16 of 22
75. (pickup b5)
   deleted: (clear b5) (on-table b5) (arm-empty)
   added: (holding b5)
   goals met: 16 of 22
76. (stack b5 b17)
   deleted: (clear b17) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b17)
   goals met: 17 of 22
77. (pickup b11)
   deleted: (clear b11) (on-table b11) (arm-empty)
   added: (holding b11)
   goals met: 17 of 22
78. (stack b11 b2)
   deleted: (clear b2) (holding b11)
   added: (arm-empty) (clear b11) (on b11 b2)
   goals met: 18 of 22
79. (pickup b3)
   deleted: (clear b3) (on-table b3) (arm-empty)
   added: (holding b3)
   goals met: 18 of 22
80. (stack b3 b11)
   deleted: (clear b11) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b11)
   goals met: 19 of 22
81. (pickup b22)
   deleted: (clear b22) (on-table b22) (arm-empty)
   added: (holding b22)
   goals met: 19 of 22
82. (stack b22 b26)
   deleted: (clear b26) (holding b22)
   added: (arm-empty) (clear b22) (on b22 b26)
   goals met: 20 of 22
83. (pickup b1)
   deleted: (clear b1) (on-table b1) (arm-empty)
   added: (holding b1)
   goals met: 20 of 22
84. (stack b1 b22)
   deleted: (clear b22) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b22)
   goals met: 21 of 22
85. (pickup b15)
   deleted: (clear b15) (on-table b15) (arm-empty)
   added: (holding b15)
   goals met: 21 of 22
86. (stack b15 b1)
   deleted: (clear b1) (holding b15)
   added: (arm-empty) (clear b15) (on b15 b1)
   goals met: 22 of 22
